src/cf/ExchangePlans/ИнтеграцияСМагазинамиСоцСетей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ExchangePlan>
		<Properties>
			<Name>ИнтеграцияСМагазинамиСоцСетей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МагазинДляИнтеграции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МагазиныСоцСетейДляИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТокенДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОкончанияДействияТокенаДоступа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьИзмененияНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьЗаказы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦеныНоменклатурыСтарая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОстаток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДляНовыхКонтрагентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступаДляНовыхКонтрагентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстановкиДатыОтгрузкиЗаказа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУстановкиДатыДляМагазинаСоцСетей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстановкиДатыОтгрузкиЗаказаКоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеДляПодстановкиВЗаказы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДляПодстановкиВЗаказы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоФотографийДляКарточки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузкиЗаказов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантВыгрузкиХарактеристик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВыгрузкиХарактеристикДляМагазинаСоцСетей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеНабораВариантов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтрокаАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьФайлыХарактеристикиИзНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРегламентногоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбмениватьсяСтатусамиЗаказа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДоставку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтрокаАвторизацииСообщества</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТокенДоступаСообщества</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОкончанияДействияТокенДоступаСообщества</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОтборПоСкладам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПодборкиТоваров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключитьВходящиеСообщения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаЗавершена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьДляОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьСкрытуюКопиюВПоддержку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникДляПодстановкиВЗаказы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиПривлеченияПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРегламентныеЗадания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеРегламентногоЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладДляПодстановкиВЗаказы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезервироватьТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавитьКНаименованиюХарактеристикиНаименованиеНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаказа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособАвторизации</Name>
					<Comment>0 - oauth, 1 - VK ID</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктурныеЕдиницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтатусыЗаказов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтатуса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеСтатуса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеЗаказаПокупателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СлужбыДоставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособДоставки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СлужбаДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СлужбыДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДСДоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СостояниеНастроек</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяСтраницы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодпискиНаСобытие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлектроннаяПочта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Капча</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ошибка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйЗаказ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

src/cf/ExchangePlans/ИнтеграцияСМагазинамиСоцСетей/Forms/АвторизацияПриложенияВКонтакте/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство( "КодПриложения", КодПриложения );
	Параметры.Свойство( "ИдентификаторГруппы", ИдентификаторГруппы );
	Параметры.Свойство( "АвторизацияВКонтактеПараметры", АвторизацияВКонтактеПараметры );
	Параметры.Свойство( "МагазинДляИнтеграции", МагазинДляИнтеграции );
	Параметры.Свойство( "СпособАвторизации", СпособАвторизации );
	Параметры.Свойство( "АвторизацияСообщества", АвторизацияСообщества );
	Параметры.Свойство( "УчетнаяЗапись", УчетнаяЗапись );

	Элементы.КнопкаОк.Доступность = Ложь;
	
	Если АвторизацияСообщества Тогда
		Элементы.СпособАвторизации.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ГруппаУспешнаяАвторизация.Видимость = Ложь;
	Элементы.ГруппаОшибкаАвторизации.Видимость = Ложь;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КнопкаОбновитьТокен(Команда)

	Если АвторизацияСообщества Тогда
		ОбновитьТокенДоступаСообществаНаКлиенте();
	Иначе
		ОбновитьТокенДоступаНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОк(Команда)

	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить( "АвторизацияСообщества", АвторизацияСообщества );
	ПараметрыЗакрытия.Вставить( "КодПриложения", КодПриложения );
	ПараметрыЗакрытия.Вставить( "ИдентификаторГруппы", ИдентификаторГруппы );
	ПараметрыЗакрытия.Вставить( "АвторизацияВКонтактеПараметры", АвторизацияВКонтактеПараметры );
	ПараметрыЗакрытия.Вставить( "МагазинДляИнтеграции", МагазинДляИнтеграции );
	ПараметрыЗакрытия.Вставить( "СпособАвторизации", СпособАвторизации );
	ПараметрыЗакрытия.Вставить( "АвторизацияСообщества", АвторизацияСообщества );
	ПараметрыЗакрытия.Вставить( "ИдентификаторПользователя", ИдентификаторПользователя );
	
	ЭтаФорма.Закрыть( ПараметрыЗакрытия );
КонецПроцедуры

&НаКлиенте
Процедура СтрокаАвторизацииИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)

    СтандартнаяОбработка = Ложь;
    
    СтрокаАвторизации = Текст;
    
    ПодключитьОбработчикОжидания( "СтрокаАвторизацииПослеИзменения", 0.1, Истина );
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьТокенДоступаНаКлиенте() 
	
	Если Не ЗначениеЗаполнено(КодПриложения) Тогда

		ОшибкаТекст = НСтр( "ru = 'Необходимо заполнить поле ""ID приложения.""'" );
		ОбщегоНазначенияКлиент.СообщитьПользователю( ОшибкаТекст );

		Возврат;
	КонецЕсли;
	
	Если СпособАвторизации = ИнтеграцияСМагазинамиСоцСетейКлиентСервер.СпособАвторизацииOAUTH() Тогда
	
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ПолучитьСсылкуНаСтрокуАвторизацииНаКлиенте());
		
	ИначеЕсли СпособАвторизации = ИнтеграцияСМагазинамиСоцСетейКлиентСервер.СпособАвторизацииVKID() Тогда
	
		АвторизацияВКонтактеПараметры = 
		ИнтеграцияСМагазинамиСоцСетейКлиентСервер.АвторизацияВКонтактеПараметрыНовый( СпособАвторизации );
		
		ИнтеграцияСМагазинамиСоцСетейВызовСервера.АвторизацияVKIDПараметрыЗаполнитьПоУмолчанию( АвторизацияВКонтактеПараметры, КодПриложения );
		
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку( АвторизацияВКонтактеПараметры.АвторизацияСтрокаURL );
	
	Иначе
	
		ОшибкаШаблон = НСтр( "ru = 'Способ авторизации задан некорректно: %1. Необходимо обратиться в техническую поддежку 1С.'" );
		ОшибкаТекст = СтрШаблон( ОшибкаШаблон, СпособАвторизации );
		ОбщегоНазначенияКлиент.СообщитьПользователю( ОшибкаТекст );
		
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСсылкуНаСтрокуАвторизацииНаКлиенте(ЭтоСообщество = Ложь) Экспорт
	
	НастройкиУзла = Новый Структура;
	НастройкиУзла.Вставить("МагазинДляИнтеграции" , МагазинДляИнтеграции);
	НастройкиУзла.Вставить("КодПриложения" , КодПриложения);
	НастройкиУзла.Вставить("ИдентификаторГруппы" , ИдентификаторГруппы);
	
	Возврат ПолучитьСсылкуНаСтрокуАвторизацииНаСервереБезКонтекста(НастройкиУзла, ЭтоСообщество);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСсылкуНаСтрокуАвторизацииНаСервереБезКонтекста(НастройкиУзла, ЭтоСообщество)
	
	Возврат ПланыОбмена.ИнтеграцияСМагазинамиСоцСетей.ПолучитьСсылкуНаСтрокуАвторизации(НастройкиУзла, ЭтоСообщество);
	
КонецФункции

&НаКлиенте
Процедура СпособАвторизацииПриИзменении(Элемент)
	СтрокаАвторизации = "";
	ОбновитьДанныеФормыИзБезопасногоХранилища();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСтрокуАвторизацииНаКлиенте(ЭтоСообщество = Ложь)
	
	Если ЭтоСообщество Тогда 
		
		Результат = ИзвлечьТокенДоступаИзСтрокиАвторизации(СтрокаАвторизации);
		
		ТокенДоступа = Результат.Получить(СтрШаблон("access_token_%1", ИдентификаторГруппы));
		
		АвторизацияВКонтактеПараметры.access_token_community = ТокенДоступа;
		АвторизацияВКонтактеПараметры.ОкончанияДействияТокенДоступаСообщества = Результат.Получить("ОкончанияДействияТокенаДоступа");
		
	Иначе
		
		Результат = ИзвлечьТокенДоступаИзСтрокиАвторизации(СтрокаАвторизации);
		
		ИдентификаторПользователя = Результат.Получить("user_id");
		ТокенДоступа = Результат.Получить("access_token");
		
		АвторизацияВКонтактеПараметры.access_token = ТокенДоступа;
		АвторизацияВКонтактеПараметры.ОкончанияДействияТокенаДоступа = Результат.Получить("ОкончанияДействияТокенаДоступа");;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ИзвлечьТокенДоступаИзСтрокиАвторизации(СтрокиАвторизации)
	
	СтрокаПоиска = "https://oauth.vk.com/blank.html#";
	
	ТекущаяДата = ОбщегоНазначенияКлиент.ДатаСеанса() - 1;
	
	Результат = Новый Соответствие;
	
	МассивЧастей = СтрРазделить(СтрЗаменить(СтрокиАвторизации,СтрокаПоиска,""),"&",Ложь);
	Если МассивЧастей.Количество() > 0 Тогда
		
		Для Каждого СтрокаПараметры Из МассивЧастей Цикл 
			
			МассивКлючЗначение = СтрРазделить(СтрокаПараметры,"=");
			Если МассивКлючЗначение.Количество() = 2 Тогда 
				Результат.Вставить(МассивКлючЗначение[0],МассивКлючЗначение[1]);
			ИначеЕсли МассивКлючЗначение.Количество() = 1 Тогда
				Результат.Вставить(МассивКлючЗначение[0],Неопределено);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОкончанияДействияТокенаДоступа = ТекущаяДата + (60*60*24 * 365); // По умолчанию 1 год
	
	СрокЖизниВСекундах = Результат.Получить("expires_in");
	Если СрокЖизниВСекундах = Неопределено Тогда
		СрокЖизниВСекундах = 0;
	Иначе
		СрокЖизниВСекундах = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(СрокЖизниВСекундах);
	КонецЕсли;
	
	Если СрокЖизниВСекундах <> 0 Тогда  
		ОкончанияДействияТокенаДоступа = ТекущаяДата + СрокЖизниВСекундах;
	КонецЕсли;
	
	Результат.Вставить("ОкончанияДействияТокенаДоступа" , ОкончанияДействияТокенаДоступа);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьДанныеФормыИзБезопасногоХранилища()
	
	АвторизацияВКонтактеПараметры = ИнтеграцияСМагазинамиСоцСетейКлиентСервер.АвторизацияВКонтактеПараметрыНовый( СпособАвторизации );
	ИнтеграцияСМагазинамиСоцСетейСервер.АвторизацияВКонтактеПараметрыИзБезопасногоХранилищеПолучить( УчетнаяЗапись, АвторизацияВКонтактеПараметры );
	    
	ТокенДоступа = Строка( АвторизацияВКонтактеПараметры.access_token );
	ТокенДоступаСообщества = Строка( АвторизацияВКонтактеПараметры.access_token_community );
	
КонецПроцедуры

&НаКлиенте
Функция ПризнакАвторизацииВидимостьОбновить()
	УспешнаяАвторизация = ЗначениеЗаполнено( ТокенДоступа );
	
	Элементы.КнопкаОк.Доступность = УспешнаяАвторизация;
    Элементы.ГруппаУспешнаяАвторизация.Видимость = УспешнаяАвторизация;
    Элементы.ГруппаОшибкаАвторизации.Видимость = Не УспешнаяАвторизация;
    
    Если УспешнаяАвторизация Тогда
    	ТекущийЭлемент = Элементы.КнопкаОк;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьТокенДоступаСообществаНаКлиенте() 

	Если ЗначениеЗаполнено(КодПриложения) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ПолучитьСсылкуНаСтрокуАвторизацииНаКлиенте(Истина));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаАвторизацииПослеИзменения()

	ТокенДоступа = "";
    ПризнакАвторизацииВидимостьОбновить();
    
    Если ПустаяСтрока( СтрокаАвторизации ) Тогда
    	Возврат;
    КонецЕсли;
    
	Если СпособАвторизации = ИнтеграцияСМагазинамиСоцСетейКлиентСервер.СпособАвторизацииOAUTH()
	Или АвторизацияСообщества Тогда
	
		ОбработатьСтрокуАвторизацииНаКлиенте( АвторизацияСообщества );
		
	ИначеЕсли СпособАвторизации = ИнтеграцияСМагазинамиСоцСетейКлиентСервер.СпособАвторизацииVKID() Тогда
		
		ПараметрыURL = ИнтеграцияСМагазинамиСоцСетейКлиентСервер.ПараметрыURLПолучить( СтрокаАвторизации );
		
		АвторизацияВКонтактеПараметры.code = ПараметрыURL.Получить( "code" );
		АвторизацияВКонтактеПараметры.device_id = ПараметрыURL.Получить( "device_id" );
		
		Если ПустаяСтрока( АвторизацияВКонтактеПараметры.code )
		Или ПустаяСтрока( АвторизацияВКонтактеПараметры.device_id ) Тогда
			ОшибкаТекст = НСтр( "ru = 'В строке авторизации не заполнены обязательные параметры: code, device_id'" );
			ОбщегоНазначенияКлиент.СообщитьПользователю( ОшибкаТекст );
			Возврат;
		КонецЕсли;
		
		ТекущаяДатаСеансаКлиент = ОбщегоНазначенияКлиент.ДатаСеанса();
		ОтветДанные = ИнтеграцияСМагазинамиСоцСетейВызовСервера.АвторизацияVKIDПоменятьКодНаТокен( АвторизацияВКонтактеПараметры );

		Если Не ОтветДанные.Свойство( "error" ) Тогда

			ТокенДоступа = ОтветДанные.access_token;
			ЗаполнитьЗначенияСвойств( АвторизацияВКонтактеПараметры, ОтветДанные );
			
			АвторизацияВКонтактеПараметры.ОкончанияДействияТокенаДоступа = ТекущаяДатаСеансаКлиент + ОтветДанные.expires_in;
			
		КонецЕсли;
	
	Иначе

		ОшибкаШаблон = НСтр( "ru = 'Способ авторизации задан некорректно: %1. Необходимо обратиться в техническую поддержку 1С.'" );
		ОшибкаТекст = СтрШаблон( ОшибкаШаблон, СпособАвторизации );
		ОбщегоНазначенияКлиент.СообщитьПользователю( ОшибкаТекст );
		
		Возврат;
	
	КонецЕсли;
	
	ПризнакАвторизацииВидимостьОбновить();

КонецПроцедуры

#КонецОбласти
